Public Attributes | List of all members
API_GridMeshVertex Struct Reference
Element Manager
Describes a Grid Mesh vertex. More...
#include <APIdefs_Base.h>
 Public Attributes
 API_GridMeshHead  | head
General header for Grid Mesh.
 API_Coord  | surfaceParam
2D coordinate of the vertex in the Grid Mesh's local coordinate system.
 API_Coord3D  | coord
3D coordinate of the vertex in the global coordinate system (relative to the owner story's height).
Detailed Description
Describes a Grid Mesh vertex.
Remarks
For more information see API_GridMesh.